# ViewSheetSetUIService Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..ViewSheetSetUIService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
The UI service which permits registration of an external server for new UI managing ViewSheetSet.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId ViewSheetSetUIService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSheetSetUIService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ ViewSheetSetUIService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace